#pragma once

// Generated For PUBGM! - NOTE : OUR OLD CHANNEL HAS BEEN BANNED PLEASE JOIN THE NEW ONE !! T.ME/ONLYY_DEVS (3.9.0) 
//SDK GENERATED BY @D_V_4

namespace SDK
{
//---------------------By ARMP---------------------------
//Script Structs
//---------------------By ARMP---------------------------

// UserDefinedStruct BP_STRUCT_BetterVehicleEffect_type.BP_STRUCT_BetterVehicleEffect_type
// 0x01B4
struct FBP_STRUCT_BetterVehicleEffect_type
{
	int                                                BornFall_0_699F66401857D3717272C3F90C031E0C;              // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FString                                     EnterTeamVideo_1_439821406CC04453172EAC6100F15A2F;        // 0x0008(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                ID_2_6258A58050DEEC1C34CC36960D71DA44;                    // 0x0018(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                Parachute_3_58CF69800AF0CE4447FE852D0F6443F5;             // 0x001C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                VehicleMusic_4_0E3A12801F42C31E41988F0109D257A3;          // 0x0020(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0024(0x0004) MISSED OFFSET
	struct FString                                     ParachuteVehicle_5_266D99802E2F69A84C03D52C0AFAC775;      // 0x0028(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     VehicleContainer_6_0FC11B00763F5CF0333D88620BFE3412;      // 0x0038(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     VehicleInBornIsland_7_536A1B00296E6F2C6F6CE5DA0FA35564;   // 0x0048(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     GiftPreview_14_558C5D4070F33535251D5E080A28E547;          // 0x0058(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     GetQualityImage_16_035D5D4050366A773BD94FF4054AD0C5;      // 0x0068(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     GetVehicleImage_17_062453006ABB76D04A9785020C4A7C45;      // 0x0078(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     GetShareGiveVersion_18_142EC3404FFEDF7558828BCC004D11DE;  // 0x0088(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     GiftPreviewShadow_19_1C8416C067541F557648D1C906B6A027;    // 0x0098(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     GetQualityImage2_20_1034C9C00A93CC5131F91D5B04AD0CD2;     // 0x00A8(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     VehicleInSocialIsland_21_2A6CAD80415C40A2077B867D0B8A25A4;// 0x00B8(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     ShareQualityImage_22_107532001D3220D2428BC2110CE56945;    // 0x00C8(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     PropertyForParachute_23_5D8FAC8075FF989E5B7DDD4703989875; // 0x00D8(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     GetVehicleImage2_27_135CDF8017A892822F0104B004A7C442;     // 0x00E8(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                MiniTVVehiclePhoto_28_7D9DC2802F47773069FB947102CE464F;   // 0x00F8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	int                                                LightParamID_29_706CFFC014B7173168C24F950D3AEF94;         // 0x00FC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               DontShowGiftBtn_30_4C275B4042CAB41D1187A9860F79DB8E;      // 0x0100(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x0101(0x0003) MISSED OFFSET
	int                                                LocalizeID_31_794C92404B9DFE895B9FEB2F080CC134;           // 0x0104(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     SprayPaint_32_6BC5C500441187985EBAEDED093D46A4;           // 0x0108(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     GiftPreviewLight_34_460F9B407F00864D101C210F042073A4;     // 0x0118(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                VehicleType_35_63A09AC03DAA668D062464CD059FE985;          // 0x0128(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x4];                                       // 0x012C(0x0004) MISSED OFFSET
	struct FString                                     GetVehicleImage3_36_135DDFC017A892832F0104B104A7C443;     // 0x0130(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                UseBattleModel_37_3F3E00C018E206AD2DD763C0068B0BBC;       // 0x0140(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x4];                                       // 0x0144(0x0004) MISSED OFFSET
	struct FString                                     AnimationName_38_25832A801B4DFB3067FC63D001DC6335;        // 0x0148(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                OldGetResource_39_7455A40056C10C6C78004B8B037ADAC5;       // 0x0158(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData05[0x4];                                       // 0x015C(0x0004) MISSED OFFSET
	TArray<float>                                      ChassisLightLoc_af_40_6D8C44C0775A192F19BFAC2E03B493D6;   // 0x0160(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	TArray<float>                                      ChassisLightScale_af_41_4E7377405EF83203535123FC08841666; // 0x0170(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               IfHideOpenDoorBtn_42_4AA1FF007FF0F8402164D8230E267A6E;    // 0x0180(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData06[0x7];                                       // 0x0181(0x0007) MISSED OFFSET
	struct FString                                     Time_43_1A6A6600069C24C6612CD4E101DB3345;                 // 0x0188(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               IfHiddenCar_44_2F8886804E73689C152A7B07070E5062;          // 0x0198(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData07[0x3];                                       // 0x0199(0x0003) MISSED OFFSET
	int                                                ShowSortId_45_69629FC029E7F1E5689819AF0D5D9CE4;           // 0x019C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	TArray<float>                                      ChassisLightLocInBattle_af_46_36A1C98065A05CD427EA43F40FE83E46;// 0x01A0(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                UseSpecialCarScene_47_58E6DEC07B07A5390A03587608B22165;   // 0x01B0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

